OpenDTEF-v1912/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      surfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

surfaceFilmModel thermoSingleLayer;

region          filmRegion;

thermoSingleLayerCoeffs
{
    filmThermoModel liquid;
    liquidCoeffs
    {
        useReferenceValues  no;
        liquid          H2O;
    }
    filmViscosityModel  liquid;

    hydrophilic     no;
    deltaWet        1e-4;

    turbulence      laminar;
    laminarCoeffs
    {
        Cf              0.005;
    }

    radiationModel  none;
    standardRadiationCoeffs
    {
        beta     0.75;
        kappaBar 0.25;
    }

    upperSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
           c0              10;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0             100;
        }
    }

    injectionModels
    ();

    forces
    (
        thermocapillary
    );

    phaseChangeModel standardPhaseChange;

    standardPhaseChangeCoeffs
    {
        Tb              373;
        deltaMin        1e-8;
        L               1.0;
    }
}
